app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("email", "phone_number", "mobile_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["email", "[FILTERED]"], ["phone_number", nil], ["mobile_number", nil], ["created_at", "2025-11-16 15:13:06.875449"], ["updated_at", "2025-11-16 15:13:06.875449"]]